---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsEQ
source: html/cca81365-aaab-0610-0407-d436ddcbb4f3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsEQ Property

A dimension that has EQ constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..

## Syntax (C#)
```csharp
public static FailureDefinitionId UndeletedConstraintsEQ { get; }
```